from .perimetr import *
from .sqare import *
from .viewier import *

'''
"from .perimeter import ": Эта строка импортирует все имена из модуля "perimeter", который находится в том же пакете,
                           что и текущий модуль. Знак "." означает текущую директорию, а "*" означает все имена.
                           Используется относительная адресация, без указания имени пакета (Geometry)!

"from .square import ": Эта строка импортирует все имена из модуля "square", который находится в том же пакете,
                        что и текущий модуль. Знак "." означает текущую директорию, а "*" означает все имена.
                        Используется относительная адресация, без указания имени пакета (Geometry)!

"from .viewer import ": Эта строка импортирует все имена из модуля "viewer", который находится в том же пакете,
                        что и текущий модуль. Знак "." означает текущую директорию, а "*" означает все имена.
                        Используется относительная адресация, без указания имени пакета (Geometry)!
'''