from viewier import show

if __name__ == "__main__":
    show()

"""
Файл __main__.py в пакете Python является основным файлом, который автоматически выполняется, 
когда пакет запускается как самостоятельное приложение.

Такой файл позволяет определить точку входа в пакет и определить, какие действия должны быть выполнены при его запуске.
Это может включать в себя инициализацию переменных окружения, запуск основного цикла программы, 
вызов других модулей или классов и т. д.

__main__.py также позволяет использовать пакет как исполняемый файл, когда пользователь запускает его непосредственно 
из командной строки, указывая путь к пакету. В таком случае код в __main__.py будет выполнен.

Как итог: файл __main__.py полезен для создания самостоятельных приложений на основе пакетов Python.
"""